//rect: lat*115200, lng*115200
/*center["lon"] = (rect[2]+rect[0])/2/115200; 
center["lat"] = (rect[3]+rect[1])/2/115200;*/

var Cities = {
		"beijing": {
			"name": "北京",
			"adcode": 110000,
            "cityCode": "010",
			"rect": [
					13383984,
					4580837,
					13437457,
					4620383
			 ]
		},
		"shanghai": {
			"name": "上海",
            "adcode": 310000,
            "cityCode": "021",
            "rect": [
                13910809,
                3524864,
                14068816,
                3672538
            ]
		},
		"tianjin": {
			"name": "天津",
            "adcode": 120000,
            "cityCode": "022",
            "rect": [
                13483484,
                4493292,
                13534155,
                4521982
            ]
		},
		"hangzhou": {
			"name": "杭州",
            "adcode": 330100,
            "cityCode": "0571",
            "rect": [
                13816276,
                3457386,
                13876313,
                3531665
            ]
		},
		"shenzhen": {
			"name": "深圳",
            "adcode": 440300,
            "cityCode": "0755",
            "rect": [
                13107645,
                2588004,
                13149487,
                2608738
            ]
		},
		"chongqing": {
			"name": "重庆",
            "adcode": 500000,
            "cityCode": "023",
            "rect": [
                12252654,
                3375709,
                12288621,
                3423541
            ]
		},
		"quanzhou": {
			"name": "泉州",
            "adcode": 350500,
            "cityCode": "0595",
            "rect": [
                13639413,
                2850813,
                13683800,
                2884197
            ]
		},
		"wuhan": {
			"name": "武汉",
            "adcode": 420100,
            "cityCode": "027",
            "rect": [
                13112066,
                3477462,
                13211085,
                3569639
            ]
		},
		"guangzhou": {
			"name": "广州",
            "adcode": 440100,
            "cityCode": "020",
            "rect": [
                13037091,
                2648286,
                13068889,
                2673320
            ]
		},
		"nanjing": {
			"name": "南京",
            "adcode": 320100,
            "cityCode": "025",
            "rect": [
                13640174,
                3658951,
                13727803,
                3749658
            ]
		},
		"chengdou": {
			"name": "成都",
            "adcode": 510100,
            "cityCode": "028",
            "rect": [
                11964559,
                3524094,
                12010203,
                3545796
            ]
		},
		"fuzhou": {
            "name": "福州",
            "adcode": 350100,
            "cityCode": "0591",
            "rect": [
                13732690,
                2993807,
                13759036,
                3014012
            ]
        },
        "wulumuqi": {
            "name": "乌鲁木齐",
            "adcode": 650100,
            "cityCode": "0991",
            "rect": [
                10056129,
                5037954,
                10117723,
                5075875
            ]
        },
        "changsha": {
            "name": "长沙",
            "adcode": 430100,
            "cityCode": "0731",
            "rect": [
                12995058,
                3235000,
                13045366,
                3270008
            ]
        },
        "xian": {
            "name": "西安",
            "adcode": 610100,
            "cityCode": "029",
            "rect": [
                12520524,
                3928799,
                12590483,
                3986613
            ]
        },
        "xiamen": {
            "name": "厦门",
            "adcode": 350200,
            "cityCode": "0592",
            "rect": [
                13596627,
                2813754,
                13622509,
                2832966
            ]
        },
        "changzhou": {
            "name": "常州",
            "adcode": 320400,
            "cityCode": "0519",
            "rect": [
                13797463,
                3646157,
                13847285,
                3675610
            ]
        },
        "zhuhai": {
            "name": "珠海",
            "adcode": 440400,
            "cityCode": "0756",
            "rect": [
                13063114,
                2552744,
                13089028,
                2573924
            ]
        },
        "dongguan": {
            "name": "东莞",
            "adcode": 441900,
            "cityCode": "0769",
            "rect": [
                13086135,
                2641952,
                13116926,
                2672520
            ]
        },
        "wuxi": {
            "name": "无锡",
            "adcode": 320200,
            "cityCode": "0510",
            "rect": [
                13852393,
                3627898,
                13874467,
                3642638
            ]
        },
        "hefei": {
            "name": "合肥",
            "adcode": 340100,
            "cityCode": "0551",
            "rect": [
                13497801,
                3661525,
                13524847,
                3674918
            ]
        }
};
